# Pandas

In [15]:
import pandas as pd

In [57]:
#read data from csv file into a dataframe
df=pd.read_csv('Downloads/sales_data_sample.csv',encoding='latin1')
df1=pd.read_json('Downloads/sample_Data.json')
df1.head(10)

,id,name,description,price,category,image
0,1,Apple iPhone 12,The Apple iPhone 12 features a 6.1-inch Super ...,999.00,Electronics,https://www.apple.com/newsroom/images/product/...
1,2,Samsung Galaxy S21,The Samsung Galaxy S21 features a 6.2-inch Dyn...,799.00,Electronics,https://images.samsung.com/is/image/samsung/p6...
2,3,Sony PlayStation 5,The Sony PlayStation 5 features an AMD Zen 2-b...,499.99,Electronics,https://www.sony.com/image/44baa604124b770c824...
3,4,LG OLED55CXPUA 55-inch 4K OLED TV,The LG OLED55CXPUA 55-inch 4K OLED TV features...,1599.99,Electronics,https://www.lg.com/us/images/tvs/md07501804/ga...
4,5,Bose QuietComfort 35 II Wireless Headphones,The Bose QuietComfort 35 II Wireless Headphone...,299.00,Electronics,https://assets.bose.com/content/dam/Bose_DAM/W...
5,6,Fitbit Versa 3 Smartwatch,The Fitbit Versa 3 Smartwatch features a built...,229.95,Electronics,https://www.fitbit.com/global/content/dam/fitb...
6,7,KitchenAid Stand Mixer,The KitchenAid Stand Mixer features a 5-quart ...,399.99,Home & Kitchen,https://www.kitchenaid.com/content/dam/global/...
7,8,Dyson V11 Absolute Cordless Vacuum,The Dyson V11 Absolute Cordless Vacuum feature...,699.99,Home Appliances,https://www.dysoncanada.ca/dam/dyson/images/pr...
8,9,Ninja Foodi Smart XL Grill,The Ninja Foodi Smart XL Grill features 6-in-1...,279.99,Home & Kitchen,https://www.ninjakitchen.com/medias/Ninja-OP50...
9,10,Canon EOS Rebel T8i DSLR Camera,The Canon EOS Rebel T8i DSLR Camera features a...,899.00,Electronics,https://www.canon.com.au/-/media/images/produc...

In [59]:
df1.tail()

,id,name,description,price,category,image
15,16,Breville Barista Express Espresso Machine,The Breville Barista Express Espresso Machine ...,699.95,Home & Kitchen,https://www.breville.com/content/dam/breville/...
16,17,Keurig K-Elite Coffee Maker,The Keurig K-Elite Coffee Maker features a str...,169.99,Home & Kitchen,https://www.keurig.com/content/dam/global-ecom...
17,18,iRobot Roomba i7+ Robot Vacuum,The iRobot Roomba i7+ Robot Vacuum features au...,799.99,Home & Kitchen,https://store.irobot.com/default/i7-vacuuming-...
18,19,Ninja Foodi Digital Air Fry Oven,The Ninja Foodi Digital Air Fry Oven features ...,209.99,Home & Kitchen,https://www.ninjakitchen.com/static/img/produc...
19,20,Cuisinart ICE-70 Ice Cream Maker,The Cuisinart ICE-70 Ice Cream Maker features ...,139.99,Home & Kitchen,https://www.cuisinart.com/share/images/product...

In [61]:
df1.info()   #displaying info of data

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 6 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   id           20 non-null     int64
 1   name         20 non-null     object
 2   description  20 non-null     object
 3   price        20 non-null     float64
 4   category     20 non-null     object
 5   image        20 non-null     object
dtypes: float64(1), int64(1), object(4)
memory usage: 1.1+ KB

In [63]:
df1.describe()
#count=total non null values
#mean=mean, std=std deviation, max, min
#25%=first quartile 
#50%=next quartile

             id        price
count  20.00000    20.000000
mean   10.50000   507.687000
std     5.91608   373.008199
min     1.00000   129.950000
25%     5.75000   244.237500
50%    10.50000   374.990000
75%    15.25000   724.742500
max    20.00000  1599.990000

In [65]:
df1.shape

(20, 6)

In [69]:
df1.columns

Index(['id', 'name', 'description', 'price', 'category', 'image'], dtype='object')

In [29]:
#dataframe
data={
    "Name":['vijay','mahesh'],
    "Age":[33,44]
}
df=pd.DataFrame(data)
df

     Name  Age
0   vijay   33
1  mahesh   44

In [47]:
df.to_csv('output.csv',index=False)
df.to_json('output.json',index=False)
df.to_excel('output.xlsx',index=False)

In [95]:
data={
    "name":['vijay','mahesh','arjun','rohit'],
    "age":[23,34,31,30],
    "salary":[50000,25000,35000,81000]
}
df=pd.DataFrame(data)
print(df)

     name  age  salary
0   vijay   23   50000
1  mahesh   34   25000
2   arjun   31   35000
3   rohit   30   81000

In [97]:
#accesing column
name=df['name']   #single column returns series of data
name

0     vijay
1    mahesh
2     arjun
3     rohit
Name: name, dtype: object

In [99]:
#selecting multiple columns
subset=df[['name','salary']]  #multiple columns returns dataframe of data
subset

     name  salary
0   vijay   50000
1  mahesh   25000
2   arjun   35000
3   rohit   81000

In [101]:
high_salary=df[df['salary']>50000]
print(high_salary)

    name  age  salary
3  rohit   30   81000

In [106]:
salary=df[(df['salary']>30000 )& (df['age']>25)]
salary

    name  age  salary
2  arjun   31   35000
3  rohit   30   81000

In [112]:
#adding new column
new=df["performance_score"]=[88,78,88,87]
df

     name  age  salary  performance_score
0   vijay   23   50000                 88
1  mahesh   34   25000                 78
2   arjun   31   35000                 88
3   rohit   30   81000                 87

In [132]:
#using insert()- df.insert(loc,"column name",some_data)
df.insert(0,"unique id",[45,9,72,37])
df

,unique id,Employee ID new,Employee ID,ID,name,age,salary,performance_score
0,45,45,45,45,vijay,23,50000,88
1,9,9,9,9,mahesh,34,25000,78
2,72,72,72,72,arjun,31,35000,88
3,37,37,37,37,rohit,30,81000,87

In [134]:
#.loc-  df.loc(row_index,'column name')=new value
df.loc[1,'salary']=100000
df

,unique id,Employee ID new,Employee ID,ID,name,age,salary,performance_score
0,45,45,45,45,vijay,23,50000,88
1,9,9,9,9,mahesh,34,100000,78
2,72,72,72,72,arjun,31,35000,88
3,37,37,37,37,rohit,30,81000,87

In [140]:
#increasing salary by 5%
df['salary']=df['salary']*1.05
df

,unique id,Employee ID new,Employee ID,ID,name,age,salary,performance_score
0,45,45,45,45,vijay,23,52500.0,88
1,9,9,9,9,mahesh,34,105000.0,78
2,72,72,72,72,arjun,31,36750.0,88
3,37,37,37,37,rohit,30,85050.0,87

In [162]:
df.columns

Index(['Employee ID new', 'ID', 'name', 'age', 'salary', 'performance_score'], dtype='object')

In [164]:
#removing columns:
#drop()- df.drop(columns=['column name'],inplace=True)  
#inplace=True means it modifies original dataset
df.drop(columns=["name","age"],inplace=True)
df

   Employee ID new  ID    salary  performance_score
0               45  45   52500.0                 88
1                9   9  105000.0                 78
2               72  72   36750.0                 88
3               37  37   85050.0                 87

In [169]:
#handelling missing data
#NaN(not a number)
data={
    "name":['vijay',None,'rohit','arjun'],
    "age":[33,None,35,34],
    "salary":[50000,None,70000,80000]
}
df=pd.DataFrame(data)
df

    name   age   salary
0  vijay  33.0  50000.0
1   None   NaN      NaN
2  rohit  35.0  70000.0
3  arjun  34.0  80000.0

In [171]:
print(df.isnull())

    name    age  salary
0  False  False   False
1   True   True    True
2  False  False   False
3  False  False   False

In [173]:
print(df.isnull().sum())

name      1
age       1
salary    1
dtype: int64

In [175]:
df.dropna(axis=0,inplace=True)   #axis=0 means rows axis=1 means columns
df

    name   age   salary
0  vijay  33.0  50000.0
2  rohit  35.0  70000.0
3  arjun  34.0  80000.0

In [183]:
#fillna() -filling missing values
data={
    "name":['vijay',None,'rohit','arjun'],
    "age":[33,None,35,34],
    "salary":[50000,None,70000,80000]
}
df=pd.DataFrame(data)

In [185]:
df.fillna(0,inplace=True)
df

    name   age   salary
0  vijay  33.0  50000.0
1      0   0.0      0.0
2  rohit  35.0  70000.0
3  arjun  34.0  80000.0

In [193]:
data={
    "name":['vijay',None,'rohit','arjun'],
    "age":[33,None,35,34],
    "salary":[50000,None,70000,80000]
}
df=pd.DataFrame(data)

In [195]:
df['age'].fillna(df['age'].mean(),inplace=True)
df

C:\Users\USER\AppData\Local\Temp\ipykernel_1128\2267534514.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['age'].fillna(df['age'].mean(),inplace=True)

    name   age   salary
0  vijay  33.0  50000.0
1   None  34.0      NaN
2  rohit  35.0  70000.0
3  arjun  34.0  80000.0

In [198]:
df['salary'].fillna(df['salary'].mean(),inplace=True)
df

C:\Users\USER\AppData\Local\Temp\ipykernel_1128\922588880.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['salary'].fillna(df['salary'].mean(),inplace=True)

    name   age        salary
0  vijay  33.0  50000.000000
1   None  34.0  66666.666667
2  rohit  35.0  70000.000000
3  arjun  34.0  80000.000000

In [204]:
#interpolation:
#interpolate()
#linear, polynomial, time
#usecases= time series data,numeric data with trends
data={
    "time":[1,2,3,4,5],
    "value":[10,None,30,None,50]
}
df=pd.DataFrame(data)
print("Before interpolation")
print(df)
df["value"]=df["value"].interpolate(method="linear")
print("After interpolation")
print(df)

Before interpolation
   time  value
0     1   10.0
1     2    NaN
2     3   30.0
3     4    NaN
4     5   50.0
After interpolation
   time  value
0     1   10.0
1     2   20.0
2     3   30.0
3     4   40.0
4     5   50.0

In [29]:
#sorting data:
#df.sort_values(by=["column name1","column name2"],ascending=[True,False],inplace=True)
data={
    "value":[5,4,44,32,13]
}
df=pd.DataFrame(data)
df.sort_values(by="value",ascending=False,inplace=True)
df

   value
2     44
3     32
4     13
0      5
1      4

In [35]:
print(df["value"].min())
print(df["value"].mean())

4
19.6

In [41]:
#groupby:
data={
    "age":[28,30,32,28,29,30],
    "salary":[50000,40000,55000,70000,78000,80000]
}
df=pd.DataFrame(data)
grouped=df.groupby("age")["salary"].sum()
grouped

age
28    120000
29     78000
30    120000
32     55000
Name: salary, dtype: int64

In [50]:
#merging:
#pd.merge(df1,df2,on="column name",how="type of join")
#customer dataframe=
df1=pd.DataFrame({
    "customer ID":[1,2,3],
    "name":['vijay','arjun','rohit']
})
#order dataframe=
df2=pd.DataFrame({
    "customer ID":[1,2,4],
    "amount":[150,250,350]
})
#merge
df_merged=pd.merge(df1,df2,on="customer ID",how="inner")
print("inner join:")
print(df_merged)
df_merged=pd.merge(df1,df2,on="customer ID",how="outer")
print("outer join:")
print(df_merged)
df_merged=pd.merge(df1,df2,on="customer ID",how="left")
print("left join:")
print(df_merged)
df_merged=pd.merge(df1,df2,on="customer ID",how="right")
print("right join:")
print(df_merged)

inner join:
   customer ID   name  amount
0            1  vijay     150
1            2  arjun     250
outer join:
   customer ID   name  amount
0            1  vijay   150.0
1            2  arjun   250.0
2            3  rohit     NaN
3            4    NaN   350.0
left join:
   customer ID   name  amount
0            1  vijay   150.0
1            2  arjun   250.0
2            3  rohit     NaN
right join:
   customer ID   name  amount
0            1  vijay     150
1            2  arjun     250
2            4    NaN     350

In [54]:
#concatenation:
#vertically(row-wise) or horizontally(column-wise)
#pd.concat([df1,df2],axis=0,ignore_index=True)
df1=pd.DataFrame({
    "customer ID":[1,2,3],
    "name":['vijay','arjun','rohit']
})
df2=pd.DataFrame({
    "customer ID":[4,5],
    "name":["mahesh","virat"]
})
df_concat=pd.concat([df1,df2],axis=0,ignore_index=True)
df_concat

   customer ID    name
0            1   vijay
1            2   arjun
2            3   rohit
3            4  mahesh
4            5   virat